infrastructure/load-test.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Warm up phase"
    - duration: 180
      arrivalRate: 50
      rampTo: 100
      name: "Sustained load phase"
    - duration: 60
      arrivalRate: 100
      rampTo: 100
      name: "Stress phase"
  defaults:
    headers:
      x-api-key: "{{ $processEnvironment.API_KEY }}"
      Content-Type: "application/json"
  payload:
    # Array of career related query payloads to randomize requests
    - path: "queries.csv"
      fields:
        - "query"
        - "model"
  ensure:
    p95: 5000
    maxErrorRate: 1

scenarios:
  - name: "Chat Interaction"
    weight: 5
    flow:
      - post:
          url: "/api/v1/chat/message"
          json:
            prompt: "{{ query }}"
            sessionId: "load-test-session-{{ $randomNumber(1, 1000) }}"
            model: "{{ model }}"
            action: "career_advice"

  - name: "RAG Query"
    weight: 3
    flow:
      - post:
          url: "/api/v1/rag/query"
          json:
            query: "{{ query }}"
            userId: "load-test-user-{{ $randomNumber(1, 1000) }}"
            maxResults: 3

  - name: "Agent Analysis"
    weight: 2
    flow:
      - post:
          url: "/api/v1/agent/analyze"
          json:
            userId: "load-test-user-{{ $randomNumber(1, 1000) }}"
            action: "analyze-skills"
            context:
              targetRole: "{{ query }}"